[
    {},
    {
        "speaker": "Roz",
        "text": "Well, it's uh... 2:07, here on the Dr. Frasier Crane Show. As I said, I'm Roz Doyle, Frasier's producer, [_looks to see if Frasier is coming_] filling in for the temporarily detained Dr. Crane. [_picks up a copy_] It's cloudy and 62 degrees outside coming up on 2:08... [_looks at clock_] right... there.  Well, let's take a call.  Hello, Lydia.  What seems to be the problem?",
        "prevSpeaker": "No Previous Speaker",
        "nextSpeaker": "Lydia"
    },
    {
        "speaker": "Lydia",
        "text": "[_v.o._] I already told you.",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Roz"
    },
    {
        "speaker": "Roz",
        "text": "Yeah, that was when I was the call screener, now I'm the host. So, tell me your problem, and take your time.",
        "prevSpeaker": "Lydia",
        "nextSpeaker": "Lydia"
    },
    {
        "speaker": "Lydia",
        "text": "Well, it started about two weeks ago.  I got this terrible obscene phone call.  It's happened several times since then and now it's to the point where I'm afraid to answer my own phone.  ",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Roz"
    },
    {
        "speaker": "Roz",
        "text": "Well, obscene phone calls can be very disturbing. [_Frasier bursts in_] But luckily, Dr. Frasier Crane has just arrived and I'm sure he knows exactly what soothing things to say.  _Roz hands the headphones to Frasier.  He is out of breath from running and can only pant into the microphone, causing Lydia to scream in fear and hang up._ ",
        "prevSpeaker": "Lydia",
        "nextSpeaker": "Roz"
    },
    {
        "speaker": "Roz",
        "text": "[_into microphone_] Maybe now would be a good time to take a break.  We'll be right back after this. [_pushes in a cart_]",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "What the hell was that all about?!",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Roz"
    },
    {
        "speaker": "Roz",
        "text": "Oh, never mind that, where were you?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Oh, god.  Somebody'd parked in my space again.  I had to park six blocks from here and sprint the whole way.  By the end, my tweed pants were throwing off so many sparks I almost caught myself on fire!  I tell you what - the minute we go to a news break I'm going to rush down there and put this withering note on his windshield. [_writing_] \"Dear discourteous driver...\"",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Roz"
    },
    {
        "speaker": "Roz",
        "text": "Whoa!  I think you've said enough right there! [_snatches his note_] Come on, Frasier.  This isn't gonna do any good!  You want to make an impression on him?  Get tough.  You go right down there and let the air out of his tires.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Oh, I wouldn't do something like that.",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Roz"
    },
    {
        "speaker": "Roz",
        "text": "Why?  It's just inconveniencing him like he inconvenienced you.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Roz, listen, the world has become uncivilized enough without me stooping to that level.  Of course I was sorely tempted last night.  I went to the movies to see \"How Green Was My Valley.\"  Lady Luck seated me in front of two elderly women who said with the arrival of each new actor, \"My God, doesn't he look young; he's dead, you know.\"  Finally I had to just walk out.",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Roz"
    },
    {
        "speaker": "Roz",
        "text": "Oh, you're on in five seconds.  And Brenda is on line one. [_enters her booth_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_on air_] Hello, Seattle.  We're back, and I would like to start by apologizing for being tardy.  Nothing quite so inconsiderate as making someone wait.  Now without further ado let's get to Brenda.  Hello, Brenda.",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Brenda"
    },
    {
        "speaker": "Brenda",
        "text": "[_v.o._] Hi, Dr. Crane. I'm having a problem with my sister. She's always... [_her phone clicks_] Oh, wait a second.  That's my other line. [_clicks over_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_annoyed_] Something tells me I'm going to be siding with Brenda's sister. **A LITTLE SOMETHING FOR ALL YOU DONALD CRISP FANS**  _Scene Two - A video rental shop Frasier enters the shop and holds the door open for an outgoing customer. She doesn't say a word._ ",
        "prevSpeaker": "Brenda",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "You're welcome! [_walks up to the counter_] Excuse me, I was wondering if you could direct me to... ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Clerk"
    },
    {
        "speaker": "Clerk",
        "text": "Friendly Video.  Yeah, I think we got that one.  Hang on a second, I'll check.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_to a customer behind him_] Don't you hate that?  You come all the way down here yourself to the store, wait patiently, and somebody who calls in from home gets preferential treatment.  ",
        "prevSpeaker": "Clerk",
        "nextSpeaker": "Clerk"
    },
    {
        "speaker": "Clerk",
        "text": "I can help the next person in line.  ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Clerk"
    },
    {
        "speaker": "Clerk",
        "text": "Hey, do we have \"The Invisible Man?\"",
        "prevSpeaker": "Clerk",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Right here!",
        "prevSpeaker": "Clerk",
        "nextSpeaker": "Clerk"
    },
    {
        "speaker": "Clerk",
        "text": "Thanks. [_in phone_] Yeah, we got it. [_hangs up_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Excuse me. I was looking for... [_the phone rings again; the clerk reaches for the phone, but Frasier places his hand on top of it_] Don't even think about it!  I'm looking for \"How Green Was My Valley.\"",
        "prevSpeaker": "Clerk",
        "nextSpeaker": "Clerk"
    },
    {
        "speaker": "Clerk",
        "text": "Huh?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "It is a beautifully acted depiction of life in a small town in Wales.  It won five Academy Awards!  It's a classic!",
        "prevSpeaker": "Clerk",
        "nextSpeaker": "Clerk"
    },
    {
        "speaker": "Clerk",
        "text": "Oh. Well, uh, this is a shot in the dark, but you might try looking in the Classics section.  _Frasier rolls his eyes and heads toward the Classics section, only to find a woman who had been behind him in line picking up the same video._ ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Uh... you're taking \"How Green Was My Valley?\"",
        "prevSpeaker": "Clerk",
        "nextSpeaker": "Woman"
    },
    {
        "speaker": "Woman",
        "text": "I heard it was great.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Yes, but you heard it from me!  You were standing next to me in the line! [_she says nothing and takes her place in line; Frasier, frustrated, goes back to the clerk_] Excuse me, is there another copy?",
        "prevSpeaker": "Woman",
        "nextSpeaker": "Clerk"
    },
    {
        "speaker": "Clerk",
        "text": "Oh yeah, that would be across the street in our \"How Green Was My Valley\" annex.  _Frasier stalks out of the store in annoyance.  FADE TO:  Scene Three - Frasier's apartment Martin is in his chair watching television. Daphne enters with a basket of laundry._ ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "[_chuckling_] Hey Daphne. Come on, you're just in time.  It's starting.",
        "prevSpeaker": "Clerk",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "I don't get this show.  People send in videos of themselves having the most embarrassing and painful accidents.  They add cartoon noises and music and everyone laughs themselves silly.",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "[_laughing at the TV show_] Boy, I bet that hurt!",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "Well, what's wrong with you?",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Frankly, I have had it with the whole boorish, ill-mannered world.  Look, Dad, would you mind terribly if I used the TV tonight?  I went to three video stores to get this tape.  I'm just dying to see it.",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "Sure, go ahead.  How many times can you watch a dog get hit with a swinging door?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_staring at Eddie_] Depends upon the dog.  _Eddie jumps down from the couch and follows Martin into the kitchen. Frasier walks over to put the tape in just as loud, piercing rock music begins playing from upstairs._ ",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "What the hell is that?!  The windows are rattling, the walls are shaking, and I am talking to no one!!",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "[_entering_] Well, I see our neighbor's at it again.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_grabs the phone_] Not for long!",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "[_entering_] I'm gonna take a nap.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Dad, you can't possibly expect to sleep in this racket.",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "Are you kidding?  I've slept through worse than this.  In Korea I dropped off in a foxhole right outside P'Anmunjom. By the time I woke up the cease-fire was over and I was the only one who didn't know about it.  Talk about having egg on your face. [_exits_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_in phone_] Yes.  Yes, would you please connect me with the young man who's just moved into the penthouse upstairs.  No, I don't know his name!  He's in the penthouse!  He has shaggy hair, tattoos all over him, his body is pierced.  Oh, and I don't know if I mentioned this but he's in the penthouse!",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_into phone_] Never mind. [_hangs up; to Daphne_] Has the world completely lost the concept of common courtesy?  Am I the only one who is resisting this tide?! [_walks out onto the balcony and bellows:_] People of Seattle, listen to me!  We are not barbarians!  We are not Neanderthals and we are not French! Do you hear that, you up there?! [_walks back in and gets a glass of sherry_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "That's his own music he's listening to, you know.  His name is Freddie Chainsaw.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Chainsaw?  Of the Newport Chainsaws?  How does an arrested adolescent who barely knows two chords get a penthouse?",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "His last album sold five million copies.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Oh.  Well, then, I'll just add that to my list of reasons to die.",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "You know, personally, I like it.  But then, we Brits have always been on the cutting edge.  You should have heard the punk rockers who rented the flat below me a few years back. They'd play the same song over and over again: [_singing_] Flesh is burning... nana nana nana.  Flesh is burning... nana nana nana. [_sighs_] Oh no.  I'm gonna have that tune in me head all day now.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Yes, well, thank you for that, Daphne.  But I've been waiting all day to watch my movie.  _He pushes play on the remote control.  The movie begins, but is suddenly undercut by Mr. Chainsaw's loud music again.  Frasier angrily jumps to his feet._ ",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Doesn't he ever stop for sex and drugs?! [_he grabs for the phone again and dials the operator_] Hello.  Yes.  Please, I insist on being connected with the young man in the penthouse. [_the music stops as Mr. Chainsaw answers his phone_] Yes, hello, Mr. Chainsaw?  Yes, how do you do?  I'm Dr. Frasier Crane.  I am your neighbor; I live right below you. Yes, do you have any idea how loud your music is?  Oh.  You do?  Well... thank you. [_he hangs up the phone, pleasantly surprised_] Well, that wasn't so bad.  The young man seemed quite amiable in his way.  _The peace is short-lived however, as the music starts up again. Frasier has had enough._ ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "I'm going out!",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "What?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "I'm going out!",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "What?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_just as the music stops_] I AM GOING OUT!",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "[_o.s._] Hey, Frasier, will you keep it down out there.  I'm trying to take a nap! **THE ETIQUETTE LESSON**  _Scene Four -- Cafe Nervosa The cafe is crowded and no tables are available.  Frasier and Niles are standing at the counter._ ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Smell me, Niles.",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "[_sniffs_] Grandpa!",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Exactly!  On my way down in the elevator today a woman thinks nothing of lighting up a cigarette.  Has the world gone mad?",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "I know exactly how you feel.  This morning I discovered a ding in the door of my car.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Let me guess - no note on the windshield?",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "No.  And even worse, after I'd left the car off at the body shop, the rental agency didn't have a single luxury car left.  They stuck me with some vehicle I believe they call a Hunchback.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "No.  I think that would be a Hatchback, Niles.",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "It's painted panic-button red, with a large rear window that pops open.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Oh, that would be the Hatchback.",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Well, there's a novel idea: name the car after its most hideous feature.  I presume it was a toss-up between \"Hatchback\" and \"What's that odor coming from the floor?\"",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_points_] Oh, look, Niles - free table!  Go, go, go, go!",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Oh, the biscotti!",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Leave it!",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Oh, no - go on without me! _Frasier reaches the table just as a couple sits down at it.  He spots another empty one in the back._ ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Oh, there!",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Oh! _They maneuver their way through a crowd of customers just in time to see that that table has already been taken as well._ ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Oh, check on table one!",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "All right, fine. _They reach the table, but the couple hasn't left yet.  Frasier and Niles stand awkwardly above them, waiting for them to leave._ ",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Oh, we're not hovering, believe me.  It's just that there... well, there's really no place else to stand.  Oh, just take your time, please.  There's no rush.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Waiter"
    },
    {
        "speaker": "Waiter",
        "text": "Is the owner of a red Hatchback here?  It's about to be towed.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Niles, isn't that your car?",
        "prevSpeaker": "Waiter",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "[_whispering_] Shh!  Someone will hear you!",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Niles, it's about to be towed!",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "I'm not owning up to that car.  I don't care if it's careening toward a baby carriage!  ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Oh.  Oh, thank you so much.  Take care, have a lovely day.  _As Frasier says this, a man sneaks in behind him and sits down at the table._ ",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Excuse me, but we were waiting for this table.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Man"
    },
    {
        "speaker": "Man",
        "text": "So get another one.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_irritated_] Well, there aren't any.  Look, you knew that we were waiting for it.  We politely stood back and let those people leave and then you just jumped right in here!",
        "prevSpeaker": "Man",
        "nextSpeaker": "Man"
    },
    {
        "speaker": "Man",
        "text": "Well, you won't make that mistake again.  ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Frasier, Frasier... forget it.  We'll just... we'll wait for another table.",
        "prevSpeaker": "Man",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "No, we won't!  This isn't about the table anymore!  This is about the erosion of common decency. [_places his coffee on the table_] Sir, when you treat me this way you encourage me to be discourteous to another.  And so on and so on. [_the man doesn't acknowledge him_] You don't have any manners, do you? [_the man continues sipping his coffee_] Then perhaps what you need is an etiquette lesson!!  _Frasier lifts the man up from his chair and roughly shoves him out the door.  He returns to find all eyes upon him in shock._ ",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "SIT DOWN, NILES! [_they sit_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "[_to a waiter_] My brother will have a decaf.  _Niles moves Frasier's coffee away from reach.  End of Act One  Act Two  Scene One - Frasier's apartment The next morning. Daphne enters with a basket of laundry, singing to herself._ ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "Flesh is burning, nana nana nana...",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "[_entering from the kitchen and singing to himself_] Nana nana nana... flesh is burning... nana nana nana... [_sees Frasier enter_] Oh, hi, Fras.  How you feeling?",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_sits at table_] Fine.",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "I didn't ask you yesterday how your day went.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "What did Niles tell you?",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "Nothing!  Geez, can't I ask you how your day went?  How was work? [_grins_] How's your bad-ass self? [_laughs_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Dammit!  Niles blabbed!",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "No, he didn't.  You made the people of Seattle column. [_presents a paper_] Right here, under \"The Crane Mutiny.\" [_laughs_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_reads_] \"Three cheers for Dr. Frasier Crane, who struck a blow against rudeness yesterday in a coffeehouse melee.\" [_throws paper down_] Perfect!  Now all of Seattle knows about my loutish behavior!",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "What are you talking about?  This guy had it coming. [_doorbell rings_] I can just picture it.  He probably looked at you and he thought, \"This guy's a creampuff, you know.  A wuss... a wimp... a cupcake...\"",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_as he reaches the door_] Dad!",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "I'm sorry, I'm just so proud of you!  ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Ah, there he is, the man who floats like a lepidoptera and stings like a hymenoptera.",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "Niles, I think you're just jealous.",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Jealous?  Don't be ridiculous!",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "This is my favorite part. [_reading_] \"With one swift move the good doctor hoisted the miscreant out on his ear, declaring, 'What you need is an etiquette lesson.'\" [_laughs_] I love that! You got your own tough-guy catchphrase!",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "It's perfect for you, Frasier.  Dirty Harry meets Emily Post.",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "Come on.  Show me how you grabbed him.  Use Niles.",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "No, no Dad.  I will not toss Niles about the room.",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Oh no, go ahead.  Rough me up, Mr. Big Hero Bully Bouncer! [_pause_] Did that sound jealous?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "A tad.",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Well, all right, I'm jealous.  Why shouldn't I be?  All my life I've backed out of fights and watching you leap into the fray like that, I... it made me think just once I'd like to experience what you felt - go nose to nose. [_sits at table_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "Oh, your day will come, son.",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "I don't know.  I tried it this morning with my dry cleaner, Mr. Kim.  I decided to give him a good tongue-lashing because he'd shattered the mother-of-pearl buttons on my best waistcoat.  Unfortunately, due to his tenuous grasp of English and the fact that his mother's name _is_ Pearl I was forced to flee his establishment amid a shower of coat hangers.",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "[_entering from her room; to Niles_] Good morning, Dr. Crane. [_to Frasier_] And to you, Dr. Crane, our very own knight in shining armor...",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Oh, great.",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "I want you to know that your assertiveness inspired me.  For weeks now, some louse has been removing my wet clothes from the washer and leaving them on the table in a soggy mess. This morning, I decided to get my revenge.  So I took off my new red panties and I popped them in with his whites.",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Bravo, Daphne.  Good for you.  God, I wish I'd been there. [_sighs_]",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Daphne, don't you think you were overreacting just a bit?",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "Absolutely not.  Those were my panties and I wasn't afraid to use them. [_Niles bites down on his fist_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "Fras, why do you keep backing away from this?  I mean, you should be proud of yourself.  We all think you did the right thing.  The newspaper does too.",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "That's right.  And I'm going to fix you a proper hero's breakfast. [_starts for kitchen_]",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "No.  No, no... Daphne.  Please, really.  It's not necessary. Thank you all.  It's just that this isn't sitting well with me.  I find it hard to believe any good can come of violence.  _The loud rock music starts up again. Frasier angrily throws down his napkin and grabs the phone._ ",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "That's it again! [_in phone_] Mr. Chainsaw.  This is Dr. Frasier Crane... _The music stops abruptly. Frasier and the others look up at the ceiling with amazement.  Frasier hangs up the phone with an air of bravado._ ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Go ahead, Daphne.  Make my eggs. _FADE TO:  Scene Two - KACL Frasier walks down the hall on the way to work.  He encounters several coworkers who give him a thumbs up or a voice of approval.  A few back away in mock fear.  He chuckles and waves them off._ ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_as he enters his booth_] You know, I do wish people would stop making such a fuss.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Roz"
    },
    {
        "speaker": "Roz",
        "text": "They will, if you quit walking up and down the hall.  You're on in five seconds. [_enters her booth_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Oh yes, all right. [_puts on headphones and pushes on air button_] Hello, this is Dr. Frasier Crane.  Who's on the line, Roz?",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Roz"
    },
    {
        "speaker": "Roz",
        "text": "We have Mitch on line three.  He's having trouble with his neighbors.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Hello, Mitch.",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Mitch"
    },
    {
        "speaker": "Mitch",
        "text": "[_v.o._] Make that _had_ trouble. This idiot next door had his leaf-blower going at 7:00am, again.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Oh, that's very inconsiderate.",
        "prevSpeaker": "Mitch",
        "nextSpeaker": "Mitch"
    },
    {
        "speaker": "Mitch",
        "text": "I'll say.  That's why I decided to give him an \"etiquette lesson.\"  I grabbed that leaf-blower and smashed it against a tree.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_gasps_] Mitch, I must say I'm stunned.  I can't imagine a more extreme response to such a minor infraction.  _DISSOLVE TO: another caller.  Frasier's jacket is off and he is slumped over the desk._ ",
        "prevSpeaker": "Mitch",
        "nextSpeaker": "Chris"
    },
    {
        "speaker": "Chris",
        "text": "[_v.o._] ...so I snuck into his backyard and shoved a whole pound of rotten shrimp into his air conditioner!  Come on summer! _DISSOLVE: another caller goes on... Frasier's sleeves are now rolled up. He listens, horrified._ ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Chuck"
    },
    {
        "speaker": "Chuck",
        "text": "[_v.o_] ...hey, he asked for it.  So I put 100 scorpions in a FedEx package.",
        "prevSpeaker": "Chris",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Look, I'm sorry, but no matter how provoked you may have been, there is no earthly justification for... [_dissolve_] SETTING SOMEONE'S LAWN ON FIRE!!",
        "prevSpeaker": "Chuck",
        "nextSpeaker": "Rochelle"
    },
    {
        "speaker": "Rochelle",
        "text": "[_v.o._] But she doesn't curb her dogs!",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Oh... [_buries his face in his hand_]",
        "prevSpeaker": "Rochelle",
        "nextSpeaker": "Rochelle"
    },
    {
        "speaker": "Rochelle",
        "text": "You don't take any guff.  Why should I?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Rochelle... all of you... look, don't you realize that your behavior is just a bit extreme?!  I displayed a minor bit of force in order to just make a point.  I didn't go around smashing windows or torching lawns!  Where does it end?",
        "prevSpeaker": "Rochelle",
        "nextSpeaker": "Rochelle"
    },
    {
        "speaker": "Rochelle",
        "text": "Are you saying that what I did was wrong?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Of course I am!",
        "prevSpeaker": "Rochelle",
        "nextSpeaker": "Rochelle"
    },
    {
        "speaker": "Rochelle",
        "text": "But what you did was okay?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "No, no!  I... come to think of it, what I did was just as wrong.  I mean, who am I to draw the line at the acceptable level of force?  Because the next person moves a little farther, and the next person, a little farther still until we finally end up with scorpions flying through the mail like Christmas bundt cakes!  What we must all agree to do is to resolve our differences with discussion and reason.  As a matter of fact, I'm going to call the gentleman that I manhandled and... and apologize to him for not having worked out our dispute in the right way in the first place- through words.  The key here is restraint.  And I do hope you'll follow my lead... Becky with the nail gun. **NO ACTORS WERE HURT DURING THE FILMING OF THIS SCENE**  _Scene Three -- Cafe Nervosa. Frasier and Niles enter the cafe. The customers applaud as they see Frasier._ ",
        "prevSpeaker": "Rochelle",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Oh... people.  People, please.  There's no need for that.  I'm no hero.  _A woman walks by and gives him a thumbs up.  He chuckles and returns the gesture._ ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "No one's ever given me the thumbs up.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well, Niles, I've driven on the freeway with you.  The rest of the hand has been well-represented. [_They sit just as the man Frasier shoved walks in the door._] Oh, look, there he is.  Mr. Harvey, I'm so glad you could come. [_stands_] You remember my brother, Niles, and uh... we're at \"our\" table.",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Harvey"
    },
    {
        "speaker": "Harvey",
        "text": "Look, I'm here, so say what's on your mind.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well, there's no need for any hostility.  I just came to talk.",
        "prevSpeaker": "Harvey",
        "nextSpeaker": "Harvey"
    },
    {
        "speaker": "Harvey",
        "text": "Talk?  You're not gonna take another shot at me?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "No! [_shouts of contention from the crowd of customers_] No, they'll be nothing like that here today!  Now, listen, I could try to explain my behavior by saying that these are stressful times we live in, that I had reached the end of my tether.  But I won't do that, because you see, I was 100% wrong.  I had absolutely no right to touch you and I accept full responsibility.",
        "prevSpeaker": "Harvey",
        "nextSpeaker": "Harvey"
    },
    {
        "speaker": "Harvey",
        "text": "Well, I'm glad to hear you say that. [_to crowd_] And I hope you all heard that too.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "So, then you accept my apology?",
        "prevSpeaker": "Harvey",
        "nextSpeaker": "Harvey"
    },
    {
        "speaker": "Harvey",
        "text": "No, I'm suing you.  And I've got a lot of witnesses that just heard you admit you were wrong. [_hands him papers_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "But, but... these are stressful times we live in and I'd reached the end of my tether!",
        "prevSpeaker": "Harvey",
        "nextSpeaker": "Harvey"
    },
    {
        "speaker": "Harvey",
        "text": "Tough!  I'm nailing you for assault!",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "But I hardly touched you!",
        "prevSpeaker": "Harvey",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Oh, Frasier, I'm not surprised he's hiding behind lawyers. What other behavior would you expect... from a chicken?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Harvey"
    },
    {
        "speaker": "Harvey",
        "text": "What did you say?",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "I was speaking to my brother. [_stands_] But, to put it in language you can understand... [_clucking_] bawk bawk bawk bawk!",
        "prevSpeaker": "Harvey",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Niles!  This is no time for you to assert yourself!",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Harvey"
    },
    {
        "speaker": "Harvey",
        "text": "[_to Frasier_] Hey, your brother's making trouble here...",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Oh, oh, oh... what are you gonna do?  Flap me with one of your big fluffy wings?",
        "prevSpeaker": "Harvey",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Niles, stop it!  Please excuse him!",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Oh, for god's sake, Frasier don't waste your breath on this hairy, knuckle-dragging, mouth-breathing troglodyte who's probably the only male in existence who suffers from penis envy! [_excitedly hops up and down on his heels_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Harvey"
    },
    {
        "speaker": "Harvey",
        "text": "You look here, buddy... _Words cannot do this justice - you have to see it. Mr. Harvey lightly pokes Niles on the shoulder.  Niles acts as if he were punched.  He begins reeling backward - laying waste to chairs and the coat hanger - finally landing atop a table and sending it and he crashing to the floor.  The entire caf e gapes at the scene as Frasier rushes to his aid._ ",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Niles!!  Niles... are you all right?!",
        "prevSpeaker": "Harvey",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "[_pulling Frasier close to him and whispering_] Counter suit!",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_jumping up_] Oh, my god!!  Nobody move him!",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Harvey"
    },
    {
        "speaker": "Harvey",
        "text": "I barely touched him!",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Then you admit you touched him! [_to crowd_] He admits it! [_Niles groans_] Oh, Niles.  Niles, I'm here for you.  I promise we're going to get you the best care that THIS MAN'S MONEY CAN BUY! [_out of earshot_] My god, Niles, that was brilliant. You even got a tear in your eye!",
        "prevSpeaker": "Harvey",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "I landed on a fork.  ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Credits"
    }
]