[
    {},
    {
        "speaker": "Roger",
        "text": "[_v.o._] Well, I had a really good year.  I decided hey, why not reward myself?  So I bought what I really wanted - a forty- eight foot cabin cruiser.  Want to know how much it cost me? I'll tell you how much it cost me: three hundred grand, not to mention the twenty thou for the custom teak decking.  Now, here's my problem: the wife wants to call this incredible vessel _Lulubelle_ , after her mother.  _Lulubelle_!  So I say, \"no, we call it the _Intrepid_.\"  So what do you think it should be called?  _Lulubelle_ or the _Intrepid_?",
        "prevSpeaker": "No Previous Speaker",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_after a beat_] Roger, at Cornell University they have an incredible piece of scientific equipment known as the tunneling electron microscope.  Now, this microscope is so powerful that by firing electrons you can actually see images of the atom, the infinitesimally minute building blocks of our universe. Roger, if I were using that microscope right now... I still wouldn't be able to locate my interest in your problem.  Thank you for your call.  ",
        "prevSpeaker": "Roger",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "And now, [_reading_] \"Hungry for Chinese tonight?  I always\"... Uh, I'm sorry, I just - we're experiencing technical difficulties.  Let's go to a pre-recorded commercial message.  ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Roz, why did you hand me this copy?  I don't do personal endorsements.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Roz"
    },
    {
        "speaker": "Roz",
        "text": "What is the big deal?  All the other personalities do them.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "The other personalities aren't doctors.  If I allow myself to become a common pitchman, I lose all my credibility.  I am a wise man, a shaman.",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Roz"
    },
    {
        "speaker": "Roz",
        "text": "Zip up your fly, wise man.  ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Bulldog"
    },
    {
        "speaker": "Bulldog",
        "text": "Whoa, Doc!  This is a radio studio, not a bus terminal.",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Look who's here, Roz.  Noel Coward.",
        "prevSpeaker": "Bulldog",
        "nextSpeaker": "Roz"
    },
    {
        "speaker": "Roz",
        "text": "Listen Bulldog, I hate to mix business with revulsion, but Frasier, as usual, will not do this promo...",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Bulldog"
    },
    {
        "speaker": "Bulldog",
        "text": "Love to. [_snatches copy from Roz_]",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Roz"
    },
    {
        "speaker": "Roz",
        "text": "Great.  I need it done now.",
        "prevSpeaker": "Bulldog",
        "nextSpeaker": "Bulldog"
    },
    {
        "speaker": "Bulldog",
        "text": "No problem.  Doc, doc, with all due respect, you're an idiot. These promos are easy money.",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "The money is irrelevant.  It's a question of integrity.",
        "prevSpeaker": "Bulldog",
        "nextSpeaker": "Bulldog"
    },
    {
        "speaker": "Bulldog",
        "text": "Integrity? [_raps on Frasier's forehead_] Hello?  We're talking liver snacks for the Bulldog. [_goes into recording booth_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_reading a piece of paper from Roz's desk_] What is this with my name on it here, Roz?",
        "prevSpeaker": "Bulldog",
        "nextSpeaker": "Roz"
    },
    {
        "speaker": "Roz",
        "text": "Oh, that's the contract for the \"Hunan Palace\" gig.  It's how much they were going to pay you.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Wow.",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Roz"
    },
    {
        "speaker": "Roz",
        "text": "I guess I need to have them change the name on here to Bulldog's.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "They pay you that much money just to read some copy?",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Roz"
    },
    {
        "speaker": "Roz",
        "text": "Yeah.  Of course, Bulldog usually adds his own special touch. _Bulldog bangs his little gong, then reads the copy over the air, with a BAD, stereotypical Chinese accent._",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Bulldog"
    },
    {
        "speaker": "Bulldog",
        "text": "Aww, so you come chop-chop to \"Hoo-nan Parace,\" where Pekin' duck is awrays extla clispy! _He emphasizes \"clispy duck\" by crinkling a sheet of cellophane into the mike, and then blowing a duck call.  As Frasier and Roz stare in disgust, he raises his arms proudly._ ",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Roz"
    },
    {
        "speaker": "Roz",
        "text": "[_to Frasier_] We're gonna get sued this time, for sure. **WOULD YOU BUY AN EGGROLL FROM THIS MAN?**  _Scene Two - Frasier's Apartment. Martin and Daphne are sorting out some photos.  Frasier enters._ ",
        "prevSpeaker": "Bulldog",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Damn it! I just put a dent in my front bumper when I pulled into my parking space.  Does anybody know what happened to that tennis ball I hung over my space so I wouldn't pull up too far?  _On cue, Eddie pads up to Frasier and drops the ball at his feet, so it can be thrown again._ ",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "He was bored, he needed a toy.  Hey, go ahead and throw it, he'll run and get it for you.  _Frasier picks up the ball, goes to the balcony and throws it over the edge, inviting Eddie to fetch._ ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "He didn't think that was funny, and he knows where you sleep.",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Dad, Daphne, a situation has arisen over at work and uh, I'm not sure how it should be handled.  I was hoping maybe your objective viewpoint could uh, be helpful.",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "Sure, shoot.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well, what would you think if I did a commercial and publicly endorsed a product?",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "Oh, you mean like Cher does?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Thank you Daphne, one against.  Dad?",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "What's the product?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well, the station wanted me to do a commercial for a Chinese restaurant.",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "Well, what's the problem?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well, I hold a position of trust in this community, and people do what I tell them to, and I would hate to be accused of abusing that position.  The thought of a doctor selling things is kind of distasteful, don't you think?",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "What about Dr. Sneezy's cold medicine?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Dr. Sneezy is a cartoon character.  The fact that he's a giant purple hippopotamus should have probably tipped you off.",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "I say take the money and run.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well, you know, I'm tempted, if for no other reason than to keep Bulldog from further alienating the Asian-American community.  I just want to make sure I don't compromise my principles.",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "Dr. Crane, you've dedicated your live to helping people, haven't you?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well, yes.",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "Well, suppose one of your listeners was in a quandary over where to buy good Chinese food?  Wouldn't your commercial be helping them?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "Look, why don't you just go down there?  If you like the food do the commercial, if you don't, don't.",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "I suppose that's the logical approach.  Why don't the three of us go tonight?  I'll make a call.  Oh, I'd better make the reservations under a different name, I don't want any special treatment, you know. [_dials_] I want them - I just want to be treated like an average working Joe. [_into phone_] Good evening... Yes... yes, we'd like a reservation for three this evening at eight.  Oh, nothing 'til ten?  Oh, well then, ah, this is Dr. Frasier Crane... from the radio, and ah... Yes, I thought you might.  Thank you. [_hangs up_] We're in at 9:45.  _FADE TO:  Scene Three - The radio station. Frasier is finishing off his commercial._ ",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Did I say tasty?  Tasty doesn't do justice to those succulent pot-stickers.  And the kung pao chicken - ooh, don't get me started.  \"So if you've got a yen for Chinese tonight, hurry on down to the Hunan Palace.\"  Well, that's it for today. This is Dr. Frasier Crane hoping we'll see you tomorrow, on KACL 780 AM.  ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "You know Roz, I think I'm getting the knack for doing these promos.  Did you hear that little ad-lib I did about the \"yen\" for Chinese food?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Roz"
    },
    {
        "speaker": "Roz",
        "text": "Yeah.  By the way, \"yen\" is Japanese, not Chinese.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well... Did I tell you, I got a call from the owners of the Hunan Palace the other day, they said that since I started doing these commercials their business had gone up by 30 percent.",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Roz"
    },
    {
        "speaker": "Roz",
        "text": "Well, isn't that what advertising is supposed to do?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Yes it is, Miss Sour-Britches, give me a little credit.  My God, I've pleased the boys upstairs, I've gotten perfect strangers to try a new restaurant, and most importantly, I've helped a struggling immigrant family who came to these shores a mere twelve years ago, with nothing more than a dream, a few recipes, and a wok.  ",
        "prevSpeaker": "Roz",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Dr. Crane?  What a privilege this is.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Excuse me?",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Bebe Glaser.  I'm Bulldog Briscoe's agent.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Ah.  Ah, well.  Pleasure meeting you.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Listen.  I'm not usually this forward, but I'm going to come right out and say it.  I've done some research and I know you're not represented by anyone, how would you feel about signing on with me as a client?  If your answer is no, it won't hurt my feelings.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well, I really don't think so.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "[_sorrowfully_] Why?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "It's not that I'm not flattered, Miss Glaser, but umm... you see, I'm not really a radio personality per se.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Oh come on, Dr. Crane, I've heard those spots you've done for that Chinese restaurant, you make me want to stuff my face full of egg rolls and... I don't know what.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Thank you.  Uh... but I, you see, I dine at the Hunan Palace frequently, and uh, that's the only reason I did those commercials.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "The last thing I would ever want you to do is to advertise something you don't believe in.  I am an agent, not a pimp.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well, I don't mean to offend...",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Are you kidding?  You're terrific, you can't offend me.  Let me just leave you with my card.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well, I really don't think that's necessary.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "[_snatches card back_] Give me back my card.  I will not let you call me.  It is too refreshing to meet someone who isn't seduced by the almighty dollar.  I would refuse your call. [_checks watch_] Ah, I've got to go.  Flying to Palo Alto, my daughter's at Stanford. [_starts to leave_] Ah, wait.  You don't have kids, do you?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well yes, I have a five year-old son.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Lucky you, you won't have to worry about it for years. [_starts to leave again_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Worry about what?",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "[_returns_] Tuition, innocent.  Oh wait, I see.  You're going to send him to a state college.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well no, no.  I plan to send him to my alma mater, Harvard.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Ouch!  Kiss it and make it better.  Have you seen Business Week's projection for college costs in the year 2010? [_gives a small, high pitched squeal_] Oh!  I've got to go, that plane is not going to wait for little Bebe. [_walks off again_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well, you know, maybe we should talk, sometime.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Let's talk now. [_comes back_] I think I can die peacefully without seeing the first half of the Stanford-Cal game. [_they walk off arm in arm_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "You see, it's not that I object to doing commercials, it's just that I would have to try a product first before I could endorse it.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Dr. Crane, I wouldn't have it any other way.  **THAT BETTER BE YOUR FOOT**  _Scene Four - A bathroom showroom. Frasier, Daphne and Martin are in swimming costumes, sitting in a Jacuzzi._ ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "Tell me again why I'm here?",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Because if I do the commercial I have to say that my friends and family enjoy this, and I won't say it unless it's true.",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "I feel kind of silly sitting here in the showroom.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well I apologize for that, but it's the best place to try one. So, tell me the truth.  Aren't you two enjoying this?",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "Well, I do like the bubbles.  It's a little like sitting in hot champagne.  Not that I've done that very much.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Dad, did you know that this unit is made from the same heat resistant space-age polymer that's used on the NASA space shuttles?",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "Great.  Next time I'm re-entering the earth's atmosphere in a hot tub I won't have to worry.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well?  Do you like it?",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "...I have to admit, it's making my hip feel a little better.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "That's all I needed to hear.  My friends like it, my family likes it - I like it.  I can do the commercial and Frederick can go to Harvard. [_a man walks into the showroom_] Oh my god! Isn't that Dave Hendler from our building?  You know, he's the head of the Seattle Psychiatric Association.  ",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "That's not Dave Hendler.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "Shh, don't worry about it.  Enjoy the quiet while you can.  _END OF ACT ONE  ACT TWO_  **780 AM ON YOUR RADIO DIAL**  _Scene Five - Frasier's Apartment. Frasier, Daphne and Martin are listening to a recording of his advert._ ",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Advert"
    },
    {
        "speaker": "Advert",
        "text": "...soothing bubbles, bubbles that will ease your aching body. This is Dr. Frasier Crane.  In these pressure-packed times, what could be better that a warm, relaxing dip in a Renwood hot tub?  Let Renwood's patented Ultra-Blow air system surround your body.  My family and friends like it...",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "[_to Martin_] That's us.",
        "prevSpeaker": "Advert",
        "nextSpeaker": "Advert"
    },
    {
        "speaker": "Advert",
        "text": "...and you'll like it too.  And if you act quickly, you'll receive a complimentary scum guard.  So hurry down to your Redwood Hot-tub dealer.  Say Frasier Crane sent you.",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_turns off recording_] Well?  What do you think?",
        "prevSpeaker": "Advert",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "I could almost smell the chlorine.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Dad?  How about you?",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "[_leaving_] I liked it.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Really?",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "Yeah.  I liked it.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "You really, really like it?",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "No, I liked it.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well, what was wrong with it?",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "Nothing.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "You hated it, didn't you?",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "Yeah.  Goodnight, Frasier. [_exits_]  ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Hello, darling. [_enters_]",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Bebe.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "First off, _mea culpa_ for dropping by unannounced, but you are going to kiss me when you hear what I've done for you.  ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Oh... hello.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "Hi.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Oh, no no no no no.  Bebe, this is Daphne Moon, my father's physical therapist. [_Bebe laughs, as if to say \"the very idea.\"_] Well, I believe I was about to kiss you for something.",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Well, today I got a very attractive offer for you to be a product spokesman, and we know they're serious because it's pay or play.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Ooh... [__he says to cover his bafflement__]",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "That's the best kind.  You get your money whether you do it or not.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Well, listen to this one.",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "How do you know that?",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "Well, I must confess, there is a chapter of my life I haven't told you or your father about.  Back when I was twelve, I starred in a television show in England.  Well, I'll leave you to your business. [_makes to escape_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Daphne, Daphne, just get back here.  You what?",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Daphne"
    },
    {
        "speaker": "Daphne",
        "text": "I starred in a TV series.  It was quite popular in its day, maybe you've heard of it?  \"Mind Your Knickers\"?  It was about a group of high-spirited, ethnically diverse twelve-year-olds in a girls' private boarding school.  I played Emma, the short, spunky one.  Of course, by the end of the series, I was sixteen, five foot ten, and they had me boozies bound up tighter than a mummy.  Well, I'm off. [_leaves_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "The woman is like an artichoke.  You just peel away one astounding leaf after another.  Well anyway, back to business. What have you got for me?",
        "prevSpeaker": "Daphne",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "[_producing tin of nuts_] Voila.  Emery's Nuts.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Oh, dear.  Oh, I can't endorse these.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Why not?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well, for one thing I don't like them, and they're sixty percent fat, they're laced with salt and they wreak havoc with my diverticulitis.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Of course they do, they're nuts.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "I'm sorry, I'm afraid I can't.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Well... then I will just tell them they can take their five figure deal and find someone else.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Five figures?",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Didn't I mention, precious?  This is for television, the big kahuna.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Television?",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Well, I understand if you have a problem.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well I-I... I don't mean to be difficult, I do have my standards, you know?  I only endorse things that I like or... or I think are therapeutic, like the hot-tub.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Let me pinch you, you're not real!",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well...",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "But still, I... I wonder if you're not being the tiniest bit shortsighted.  Research has shown that a single television commercial can turn an obscure radio personality into a national celebrity... a year from now, someone like you could be broadcasting your message of hope and healing not just to the Pacific Northwest, but to the entire nation.  But of course, there's not much I can [_opening tin_] do about it if you [_slides tin over to Frasier_] don't like the product.  _Frasier slowly picks up the tin and forces himself to eat a nut.  FADE TO:_ **THE BIG KAHUNA**  _Scene Six - Television studio. Frasier is sitting in front of the makeup mirror with Bebe. He has two paper tissues round his neck, to protect his collar._ ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "I've never been one hundred percent happy with my nose.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "You can't be serious.  That's a nose people trust.  ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Finally, a script.  Thanks, Jeff. [_hands it to Frasier_] Seen it already, you're going to love it.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_reading_] \"Two nuts are arguing with each other.\"  That's cute. \"�I'm a nut.' �No, I'm a nut!'\" Ha, that's funny.  Ah... \"�Hold it, you're both nuts.  I'm Dr. Frasier Crane, noted psychiatrist, and I know a nut when I see one.'\"  Hmm, I just, I don't know abut that line.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Oh, what's wrong?  It's a scream.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Yes, but it... it may be a scream, but it, it's... what's the word I'm looking for?",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "What?  \"Tuition?!\"  \"Retirement beach house?!\" [_calms down_] I'm so sorry.  I'm so sorry, it's just that I want so much for you.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Bebe, I don't want to get a reputation for being difficult, but I... I'm just not comfortable with this line.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Frasier?  Frasier, Frasier.  How long have we been together?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Six days.",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "Do you think I would ever have you do something that you were uncomfortable with?  What makes this so wonderful is that you're spoofing yourself, you're showing that psychiatrists can be loose, you're making shrinks more accessible to the average person.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "So what you're saying is that I would be doing psychiatry a service by doing this commercial?",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "You have a way of cutting through the baloney that knocks me out cold.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_reading_] Oh, dear.  What does this mean?  \"Frasier comes out of his shell.\"  _Bebe notices two stagehands pulling on set a giant monkey nut, and swivels Frasier's chair round so he can't see it, B.S.-ing as she does so._ ",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Bebe"
    },
    {
        "speaker": "Bebe",
        "text": "It is a... technical term.  It's a light... a lighting thing. You, you see, you come out of your shadow, or your shell, into the light.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_in awe_] I have so much to learn about this business. **KNEES TOGETHER, LIPS APART**  _Scene Seven - Cafe Nervosa. Niles is sitting at a table when Frasier rushes in.  He still has the tissues around his neck._ ",
        "prevSpeaker": "Bebe",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Oh Niles, Niles, thanks for meeting me, I have to talk to you about something.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Why do you have that ridiculous tissue around your neck?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well, they didn't tell me I could take it off, so I kept it on.",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Oh, silly me.  Here I thought it was just a means to attract attention, to have people come up to you and say, \"Are you an actor?\" thus affording you the opportunity to say yes, you are indeed an actor, and then proceed to crow, gloat and strut in a way you could not otherwise do.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "And the reason you have \"SHRINK\" on your license plate would be...?  Niles, listen.  I've got to do this commercial in half an hour and... I just don't think I can go through with it, I'm afraid that I'm compromising my integrity as a psychiatrist.",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Why do you feel like that?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well, for one thing my co-stars are dressed up as an almond and a walnut.  Now listen Niles, I've... I need your guidance.",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Frasier, I don't see this as a problem.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "You don't think this is the selling out of Frasier Crane?",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Oh, certainly not.  You sold out a long time ago.  You know, the moment you agreed to do that call-in show, you sold out.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Oh, Niles.  You are such a purist.  Granted, I can't do the kind of in-depth analysis one can with a single patient, but my show helps literally thousands of people a day.",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Let's face it, Frasier, you talk about wanting to safeguard your professional dignity, but the first time you went on the air, you got out of medicine and into showbiz.  You're no different from that movie star who let everybody look up her skirt in that film, and then did nothing but complain that nobody took her seriously as an actress.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Well, that has nothing to do with this!",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Have you seen that movie?  Maris and I rented the video and, I don't mind telling you, we pushed our beds together that night! [_pause_] And that was no mean feat.  Her room, as you know, is across the hall.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Niles, will you just tell me, would you do it?",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "A nude scene?  I suppose if it were integral to the plot...",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Not a nude scene!  Would you do this commercial?",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "Oh, certainly not, I'm a respected psychiatrist. [_looks at watch, then stands_]",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "So what you're saying is that I shouldn't do it.",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Niles"
    },
    {
        "speaker": "Niles",
        "text": "No, no no no.  I'm saying it doesn't matter.  Let's face it, Frasier - they've already looked up your skirt and they've seen everything there is to see.  _Niles exits.  Frasier sits with his knees tightly together.  FADE TO:_ **FRASIER CRANE TO BLOCK**  _Scene Eight - Frasier's Apartment. It's nighttime, and Frasier is sitting on the couch, watching a video of the commercial.  Martin enters._ ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "What are you still doing up? [_sees Frasier rewinding the video_] Oh geez, you're not watching the tape of that dumb commercial again!",
        "prevSpeaker": "Niles",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "I can't get it off my mind.  Did I do the right thing?",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "Of course you did.  Freddie's gonna thank you for it.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Here, watch it with me one more time.  _He starts the video.  The commercial consists of two nuts arguing until the monkey nut opens up, revealing... Dr. Joyce Brothers._ ",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Advert"
    },
    {
        "speaker": "Advert",
        "text": "Stop!  You're both nuts!  I'm noted psychologist Dr. Joyce Brothers and I'm here to tell you that I'm just crazy about Emery's Nuts.  So if you're crazy about nuts too, pick up a can of Emery's today.  Emery's - the nut lover's nut.",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "[_switching off video_] I suppose you're right, dad.  Freddie will thank me.  Dr. Joyce is his favorite psychologist.",
        "prevSpeaker": "Advert",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "You know, Dr. Joyce is pretty good.  I remember her from \"Hollywood Squares.\"  She was always under Charlie Weaver.  ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "No, no.  Charlie Weaver was always on the bottom.",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "No, I don't think so.  Let's see, Paul Lynn was in the middle, George Goldblum was under him, and... where was Wally Cox?",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Frasier"
    },
    {
        "speaker": "Frasier",
        "text": "Wally Cox.  Uh, upper left, next to Rosemarie Dubarr.",
        "prevSpeaker": "Martin",
        "nextSpeaker": "Martin"
    },
    {
        "speaker": "Martin",
        "text": "Oh, right...  ",
        "prevSpeaker": "Frasier",
        "nextSpeaker": "Credits"
    }
]